Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: །སྲོག་གཅོད་པ་ལས་ནི་རྣམ་པར་ཟློག་གོ །མ་བྱིན་པར་ལེན་པ་དང་ནི་རྣམ་པར་འབྱེད་པ་མཛད་དོ།
en: He turns the people away from killing. He dissuades them from theft.

source: །གཞན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལ་མངོན་པར་ཞེན་པ་ནི་རྣམ་པར་ཞི་བར་མཛད་དོ།
en: He causes them to cease yearning for those who belong to others.

source: །བརྫུན་དུ་སྨྲ་བ་ལས་ནི་ཕྱིར་ཟློག་པ་མཛད་དོ།
en: He makes them turn away from lying. He makes them desist from slander.

source: །ཕྲ་མའི་ཚིག་དང་ནི་རྣམ་པར་འབྲལ་བར་མཛད་དོ། །ཞེ་གཅོད་པའི་ངག་ནི་རྒྱུན་གཅོད་པ་མཛད་དོ།
en: He makes them cease speaking harshly.

source: །ཚིག་ཀྱལ་པ་ལས་ནི་ཡོངས་སུ་གློན་ནོ།
en: He makes them avoid idle talk.

source: །ཆགས་སེམས་དང་ནི་མྱི་འདྲེ་བ་མཛད་དོ།
en: He causes their minds to be free from craving.

source: །གནོད་སེམས་དང་ནི་རྒྱང་སྲིང་ངོ་།
en: He makes them dispel malice.

source: །ལོག་པར་ལྟ་བ་དང་ནི་འདྲེ་བ་མྱེད་པར་མཛད་དོ།
en: He makes them disengage from false views.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རྒྱལ་པོ་མེ་གང་ན་བ་དེར་ཕྱིན་ན།
en: Then Sudhana, the head merchant’s son, went to where King Anala was.

source: དེས་མཐོང་བ། རྒྱལ་པོ་མེ་དེ་ནི་རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་ཆེན་པོ་རྡོ་རྗེ་མཐུ་བོ་ཆེའི་ནོར་བུ་སྣ་ཚོགས་ཀྱིས་སྨྲས་པ།
en: He saw King Anala seated on a great lion throne that was beautified by various powerful diamond jewels.

source: རིན་པོ་ཆེ་འོད་གསལ་བ་རྣམ་པ་སྣ་ཚོགས་གྲངས་མྱེད་པ་ལས་བྱས་པའི་རྐང་པ་བཀྱེ་བ།
en: It had legs that shone with countless and various kinds of jewels.

source: རིན་པོ་ཆེ་གཅིག་མ་ཡིན་པས་ལེགས་པར་སྤྲས་ཤིང་བརྒྱན་པས་ཡིད་དུ་འོང་བའི་ལྷུན་དང་ལྡན་པ།
en: It had a beautiful form adorned and beautified by numerous jewels.

source: གསེར་གྱི་ལྕག་པོད་ཀྱི་དྲ་བས་ལེགས་པར་བླས་ཤིང་ཆུབ་པར་བཏགས་པ།
en: It was perfectly covered with a network of gold threads.

source: ནོར་བུ་རིན་པོ་ཆེ་དུ་མའི་སྒྲོན་མེས་ཤིན་ཏུ་སྣང་བར་བྱས་པ།
en: It was illuminated by numerous precious lamps.

source: ནོར་བུ་རིན་པོ་ཆ་དབང་གི་རྒྱལ་པོ་ལས་བྱས་པའི་པད་མོའི་སྙིང་པོ་ཅན།
en: It had a center of lotuses made from the precious jewels called the king of power

source: ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྟན་རིམ་པ་དུ་མར་བཏིང་བ།
en: It had many layers of beautiful cushions made of precious divine materials.

source: གམ་ཡོ་ནས་ལྷ་རྫས་ཀྱི་སྤོས་སྣ་ཚོགས་ཀྱི་བདུག་སྤོས་ཀྱིས་ཤིན་ཏུ་བདུགས་པ། རིན་པོ་ཆེའི་རྒྱལ་མཚན་བསྒྲེང་བ། བརྒྱ་ཕྲག་སྟོང་གིས་མཛེས་པར་བྱས་པ།
en: It was perfumed by the aroma of the various divine incenses arranged around it. It was made magnificent by a hundred thousand erected precious banners.

source: རིན་པོ་ཆེའི་བ་དན་བརྒྱ་ཕྲག་སྟོང་རྣམ་པར་བྲེས་པས་བརྒྱན་པ།
en: It was beautified by a hundred thousand raised precious flags.

source: རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཆུན་པོ་སྣ་ཚོགས་ཀྱི་ལྡ་ལྡི་རབ་ཏུ་བཀྱེ་བས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ།
en: It was beautified by arrangements of clusters of precious flowers.

source: སྟེང་ནས་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་བླ་རེ་སྣ་ཚོགས་བྲེས་པ་ཞིག་ལ་འདུག་ཅིང་།
en: It was covered from above by various canopies made of precious divine materials.

source: དེ་ནི་གཞོན་ཞིང་དར་ལ་བབ་པ།
en: King Anala was a youth who had reached adulthood.

source: གཟུགས་མཛེས་ཤིང་བལྟ་ན་ཡིད་དུ་འོང་བ།
en: He was handsome and attractive.

source: སྐྲ་མཐོན་ཏིང་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ་དང་ལྡན་པ།
en: His hair was deep black and curled to the right.

source: མགོ་གདུགས་ལྟར་འདུག་པ་གཙུག་ཏོར་གྱི་སྤྱི་བོ་ཅན།
en: His head was like a parasol, with an uṣṇīṣa on the crown of his head.

source: འཕྲལ་བ་ཡངས་པ། མྱིག་དཀར་ནག་འབྱེས་ཤིང་རིང་ལ།
en: He had a broad forehead and wide, deep black eyes.

source: རྫི་མ་བའི་རྫི་མ་ལྟར་འདུག་པ།
en: His eyelashes were like the eyelashes of a cow.

source: སྣའི་དབྱིབས་ལེགས་ཤིང་བཟང་ལ་རན་པར་མཛེས་པ་དང་ལྡན་པ། མཆུ་མཚལ་ལྟར་མདོག་བཟང་ཞིང་ཤིན་ཏུ་ལེགས་པ་དང་ལྡན་པ།
en: His nose was lovely, high and prominent. His lips were the beautiful color of vermilion and perfectly proportioned.

source: སོ་མཉམ་ཞིང་ཐགས་བཟང་ལ་ཤིན་ཏུ་དཀར་བ་བཞི་བཅུ་ཚང་བ་དང་ལྡན་པ།
en: His teeth were even, without gaps, very white, and a full forty in number.

source: འགྲམ་པའི་ལྷ་ང་སེང་གེའི་འགྲམ་པ་ལྟར་འདུག་པ་ཁུར་བ་ཤས་རྒྱས་པ།
en: He had jaws like a lion.

source: སྨིན་ཚུགས་གཞུ་ལྟར་འདུག་ཅིང་རིང་ལ་ཤིན་ཏུ་མཛེས་པ།
en: His cheeks were full and wide. His eyebrows were long, beautiful, and curved like a bow.

source: མཛོད་སྤུ་ཟླ་བའི་ཁ་དོག་ལྟར་འདུག་པའི་ཐིག་ལེ་ཅན།
en: He had the mark of the ūrṇā hair the color of the moon.

source: རྣ་བའི་ཤལ་རིང་ཞིང་ལྷོད་པར་འཕྱང་བ།
en: His earlobes were long and hung loosely.

source: ཟླ་བ་ཉ་བ་ལྟར་བཞིན་མདངས་དང་ལྡན་ཞིང་ཤིན་ཏུ་བཟང་བ།
en: His face was bright and beautiful like the full moon.

source: མགུལ་ཟླུམ་ཞིང་དུང་ལྟར་མཛེས་པ།
en: His throat was round and as beautiful as a conch.

source: སྙིང་ཀ་དཔལ་གྱི་བེ་འུས་བརྒྱན་པ།
en: His heart area was adorned by the śrīvatsa.

source: རོ་སྟོད་སེང་གེའི་རོ་སྟོད་ལྟར་འདུག་པ།
en: His upper body was like the upper body of a lion.

source: ཐལ་གོང་ཤིན་ཏུ་རྒྱས་ལ།
en: The flesh between his shoulder blades was muscular.

source: དཔུང་མགོའི་ལྷུན་ལེགས་ཤིང་ཟླུམ་པ།
en: His shoulders were bulky and rounded.

source: ལག་པ་རིང་བ་དྲ་བར་འབྲེལ་བའི་སོར་མོ་ཅན།
en: His arms were long. His fingers were webbed.

source: རྐང་ལག་འཁོར་ལོས་བརྒྱན་པ།
en: His hands and feet were adorned by wheels.

source: རྐང་ལག་འཇམ་ཞིང་གཞོན་ལ་ཤས་རྒྱས་པ།
en: His hands and feet were soft, young, and thick.

source: བདུན་ཤིན་ཏུ་མཐོ་བ།
en: He had the seven prominences.

source: རྐེད་པ་རྡོ་རྗེ་ལྟར་འདུག་པ།
en: His waist was slim like a vajra’s.

source: ལུས་ཆེ་ཞིང་དྲང་བ།
en: His body was big and straight.

source: བརླ་ཟླུམ་པ།
en: His thighs were round.

source: ཕོ་མཚན་གསང་བའི་སྦུབས་ན་འདུག་པ།
en: His penis was retracted into his body.

source: བྱིན་པ་རི་དགས་ཨེ་ནེ་ཡའི་བྱིན་པ་ལྟར་འདུག་པ།
en: His calves were like the calves of a female blackbuck.

source: སོར་མོ་རིང་བ།
en: His fingers were long.

source: རྐང་པའི་རྟིང་བ་ཡངས་པ།
en: The heels of his feet were wide.

source: འོད་འདོམ་གང་བ་དང་ལྡན་པ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ།
en: He had a halo a fathom in width. He was golden in color.

source: བ་སྤུ་རེ་རེ་ནས་གཡས་ཕྱོགས་སུ་གྱེན་དུ་འཁྱིལ་བ།
en: Each of his body hairs was curled upward to the right.

source: ཤིང་ནྱ་གྲོ་དའི་རྒྱལ་པོ་ལྟར་ཆུ་ཞེང་གབ་པ།
en: He had the circular symmetry of a king banyan tree.

source: ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཤིན་ཏུ་བརྒྱན་པ།
en: He was adorned by the signs and features of a superior being.

source: མགོ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་ཅོད་པན་ཐོགས་པ།
en: He wore a precious wish-fulfilling jewel as his topknot crest.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བྱས་པའི་འབྲལ་བའི་རྒྱན་ཟླ་གམ་གྱིས་མཛེས་པར་བརྒྱན་པ།
en: His forehead was adorned by the adornment of a crescent moon made from Jambu River gold.

source: རྣ་བ་ལས་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་རྣ་ཆ་དྲི་མ་མེད་པ་འཕྱང་བ། ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མྱེད་པའི་སེ་མོ་དེའི་འོད་ཀྱིས་སྣང་བར་བྱས་པས།
en: Stainless sapphire jewel earrings hung from his ears.

source: དྲི་མ་མྱེད་པའི་རོ་སྟོད་རྒྱས་པ་དང་ལྡན་པ།
en: He had a wide, stainless upper body.

source: ལྷ་རྫས་ཀྱི་ནོར་བུ་དམ་པའི་དཔུང་རྒྱན་དང་། གདུ་བུས་ལག་པ་མཛེས་པར་བརྒྱན་པ་ཞིག་སྟེ།
en: His arms were beautified by armlets and bracelets made of sublime divine jewels.

source: རིན་པོ་ཆེའི་གདུགས་ཆེན་པོ་རིན་པོ་ཆེ་བཻཌཱུརྱ་དྲི་མ་མྱེད་པའི་ཡུ་བ་ཅན།
en: Held above him was a precious great parasol with a stainless precious handle of beryl;

source: རིན་པོ་ཆེའི་ཤར་བུ་བརྒྱ་ཕྲག་བཅུས་རྣམ་པར་ཕྱེ་བ།
en: with a covering made of Jambu River gold;

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་བླ་གབ་ཅན་ནོར་བུ་རིན་པོ་ཆེ་སྒྲ་སྣང་བ་རྣམ་པར་དག་པའི་སྙིང་པོ་ཅན།
en: with a pure, large, precious asteria jewel in the center;

source: རིན་པོ་ཆེའི་དྲིལ་བུའི་ཕྲེང་བ་ལས་སྒྲ་སྙན་ཅིང་། ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: and with a string of precious little bells from which came sweet, pleasant sounds;

source: ནོར་བུ་རིན་པོ་ཆེའི་འོད་ཕྱོགས་ཀུན་ཏུ་འཕྲོ་བ་ཅན་དྲུང་ནས་བཟུང་ཞིང་བསྒྲེང་བ།
en: the light from its precious jewels shone in all directions.

source: རྒྱལ་པོའི་གཟི་བརྗིད་དང་དབང་ཆེན་པོ་ལ་གནས་པ། སྲིད་ལ་གཞན་གྱི་འཁོར་གྱིས་གཙེ་བ་མེད་པ།
en: He had attained the majesty and sovereignty of a king who could not be harmed by enemy armies.

source: དགྲའི་འཇིགས་པ་དང་བྲལ་བའི་དབང་ཕྱུག་དང་ལྡན་པར་འདུག་པ་མཐོང་ངོ་།
en: He had such power that he had no fear of enemy armies.

source: །དེའི་འཁོར་ཀུན་ནས་ཀྱང་བློན་པོ་སྟོང་ཕྲག་བཅུ་ཚོགས་ཤིང་རྒྱལ་པོའི་དགོས་པ་བསྒྲུབ་པ་ལ་བརྩོན་པ་མཐོང་ངོ་།
en: He had an entourage of ten thousand ministers dedicated to accomplishing whatever the king required. Sudhana saw that in front of King Anala there were those who carried out his punishments.

source: །དེའི་མདུན་ན་ཆད་པས་གཅོད་པའི་མྱི་སེམས་ཅན་དམྱལ་བའི་སྲུངས་མ་ལྟ་བུ།
en: They resembled the guardians in the hells.

source: གཤིན་རྗེའི་གཡོག་འཁོར་ལྟ་བུ་འཇིགས་འཇིགས་ལྟའི་གོས་གྱོན་པ།
en: They wore terrifying clothing like the servants of Yama.

source: གཏུམ་ཞིང་མྱི་བཟད་ལ་འཇིགས་པ་ཆེན་པོ་བསྐྱེད་པ་མྱིག་དམར་བ་སོ་གཙིགས་པ།
en: They were ferocious, horrible, and greatly terrifying. Their eyes were red, and they were biting their lower lips.

source: གདོང་གི་གཉེར་མ་གསུམ་ཁྲོ་གཉེར་དུ་བསྡུས་པ།
en: Their faces had the threefold lines of frowning wrathfully.

source: རལ་གྱི་དང་། སྟ་རེ་དང་། ལྕགས་ཀྱི་ཆང་མདུད་དང་། མདའ་དང་། བེ་རྒ་དང་། མདུང་ལ་སྩོགས་པའི་མཚོན་ཆ་དང་། ལག་ཆ་ཐོགས་པའི་ལུས་དང་། བཞིན་གྱི་དབྱིབས་མྱི་སྡུག་ཅིང་འཇིགས་སུ་རུང་བ།
en: They were holding weapons and tools such as swords, axes, spears, short spears, clubs, long spears, and so on. They had ugly, terrifying faces.

source: སྤྲིན་ནག་པོ་ལྟར་འདུག་པ། མྱི་སྙན་ཅིང་བརླང་ལ་བསྔངས་པའི་སྒྲ་དྲག་པོ་འབྱིན་པ། གཟི་ལྟ་བར་དཀའ་བ། འཇིགས་པ་ཆེན་པོ་བསྐྱེད་པ། སྲོག་ཆགས་བརྒྱ་ཕྲག་སྟོང་གི་སྙིང་འགེམས་པར་བྱེད་པ།
en: They were like a black cloud, emitting horrible, dreadful shouts of rage, unbearable to look at, inspiring great terror, and bringing fear into the hearts of a hundred thousand beings, and they were dedicated to punishing those deserving of punishment.

source: དེ་ལྟ་བུ་དག་ཆད་པས་གཅད་པར་འོས་པའི་སེམས་ཅན་ཆད་པས་གཅོད་པ་ལ་བརྩོན་པ་མཐོང་ངོ་།
en: He saw many hundreds of thousands of individuals who had committed various crimes, each bound tightly with five ropes, brought before King Anala.

source: །དེ་ན་སྲོག་ཆགས་རྐུ་བ་གཞན་གྱི་ནོར་ལ་འཕྲོག་པ།
en: There were thieves; those who had seized others’ property;

source: སེམས་ཅན་གྱི་ལོངས་སྤྱོད་ཆུད་གསོན་པ།
en: those who had destroyed the property of others;

source: ལམ་སྒུགས་ཤིང་འཕྲོག་པ།
en: those who had robbed travelers;

source: གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྷས་ལ་མྱེས་གཏོང་བ།
en: those who had burned down villages, towns, and markets;

source: གྲོང་དུ་ཆོམ་པོ་བྱེད་པ། ཁྱིམ་ཕུགས་འདེབས་པ།
en: those who had slain families; those who were burglars;

source: སྡིག་སྡིག་ལྟར་བྱེད་པ།
en: those who had injured;

source: དུག་ལྡུད་པ།
en: those who had poisoned;

source: དཀྲུགས་མ་བྱེད་པ།
en: those who had rioted;

source: ཐོང་མི་བྱེད་པ། བྱི་བོ་བྱེད་པ།
en: those who had murdered;

source: ལོག་པར་ཞུགས་པ།
en: those who had seduced the wives of others;

source: གནོད་པར་སེམས་པ། འདོད་ཆེན་ཆེ་བ།
en: those with a bad way of life;

source: སྡིག་པ་སྣ་ཚོགས་ཀྱི་ལས་མྱི་བཟད་པ་བྱེད་པ།
en: those with evil intentions;

source: བརྒྱ་སྟོང་མང་པོ་བཅིང་བ་དམ་པོ་ལྔས་བཅིངས་ཤིང་རྒྱལ་པོ་མྱེའི་དྲུང་དུ་ཁྲིད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: and those who were covetous.

source: །དེ་དག་ལའང་རྒྱལ་པོ་མྱེས་ཅི་རིགས་བར་ཆད་པས་གཅད་པར་གྱུར་པ་མཐོང་ངོ་། །དེས་དེ་ན་རྒྱལ་པོ་མེས་བསྒོ་ཞིང་ལ་ལ་ནི་རྐ་ལག་གཅད།
en: Sudhana saw King Anala have them punished in various ways.

source: ལ་ལ་ནི་རྣ་བ་དང་སྣ་བཅད། ལ་ལ་ནི་མྱིག་ཕྱུང་། ལ་ལ་ནི་ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་བཅད།
en: Sudhana saw, according to King Anala’s commands, some having their hands and feet cut off, some their ears and noses cut off, some their eyes gouged out, and some their limbs and all the smaller parts of the bodies cut off.

source: ལ་ལ་ནི་ལུས་ཐམས་ཅད་མེས་བཏང་། ལ་ལ་ནི་བ་ཚྭའི་ཆུ་ཁོལ་མས་ལུས་ལ་གཏོར་ཅིང་པགས་པ་བརྙིལ་བ་ལ་སྩོགས་པ། དེ་ལྟ་བུའི་ཆད་པ་སྣ་ཚོགས་དུ་མ་མི་བཟད་པ་དྲག་པ་བརླང་བ་ཡིད་དུ་མི་འོང་བ་སྲོག་འཕྲོག་པ་དག་ཀྱང་བྱེད་པར་མཐོང་ངོ་།
en: Some were decapitated, some were burned alive, some had their skin destroyed by boiling salt water being poured over their bodies, and there were various other punishments that were horrible, harsh, cruel, dreadful, and deadly.

source: །གསད་པའི་ས་དེ་ན་འང་བསད་པའི་རྐ་ལག་དང་། རྣ་བ་དང་། མྱིག་དང་། སྣ་དང་། མགོ་དང་། ཡན་ལག་དང་། ཉིང་ལག་གི་ཕུང་པོ་རི་རབ་ཙམ་དུ་སྤུངས་པ་མཐོང་ངོ་།
en: Sudhana saw that at the site of the executions there was a mound of the feet, hands, ears, eyes, noses, heads, limbs, and smaller parts of the bodies of those who had been executed that was as large as Sumeru

source: །ཁྲག་གི་མཚོ་དཔག་ཚད་གསུམ་ཙམ་དུ་ཟབས་སུ་ཟབ་ལ་ཆུ་ཞིང་དུ་དཔག་ཚད་དུ་མ་ཡོད་པ་ཡང་མཐོང་ངོ་།
en: He saw a lake of blood that was three yojanas deep and many yojanas wide.

source: །དེ་ན་ཤི་བའི་ཀེང་རུས་ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་དང་བྲལ་བ་བརྒྱ་སྟོང་དུ་མ་ལ།
en: He saw there many hundreds of thousands of the skeletons of the dead, missing their limbs, smaller parts, and heads.

source: སྤྱང་ཀི་དང་ཝ་དང་། ཁྱི་དང་བྱ་རོག་དང་། བྱ་རྒོད་དང་། ཁྲ་དང་བྱ་ཀུ་རར་མང་པོས་གང་སྟེ། འདྲད་ཅིང་འཐོག་པ་མཐོང་ངོ་། །དེ་ལའང་ལ་ལ་ནི་ཁ་དོག་གྱུར་ཏེ། སྔོན་པོར་གྱུར་པ་ཙམ།
en: The place was filled with many wolves, jackals, dogs, ravens, vultures, buzzards, and eagles.

source: ལ་ལ་ནི་རྣགས་པ་ཙམ། ལ་ལ་ནི་བམ་པ་ཙམ། ལ་ལ་ནི་འབུ་ཞུགས་པ་ཙམ་དུ་གྱུར་ཏེ། ཤིན་ཏུ་སྐྱི་གཡའ་ཞིང་འཇིགས་འཇིགས་ལྟར་འདུག་པ་མཐོང་ངོ་། །གསང་བ་དེ་དག་གསོད་པའི་ཚེ།
en: He saw that some bodies were darkened to black, some were rotting, some were bloated, and some were filled with maggots, loathsome and terrifying.

source: མྱི་སྡུག་པ་ཆོ་དགུར་བྱས་པས་ན་འཇིགས་འཇིགས་སྐད་དང་། སྙིང་རྡོ་རྗེ་སྐད་དུ་སྒྲ་འབྱིན་ཅིང་ཆོ་ངེས་འདེབས་པའི་སྒྲ་ཆེན་པོ་ཐོས་ན།
en: He heard the sounds of the loud, horrible screams of pain, the pitiful wailing being emitted by those being executed, being slain, and being slaughtered in various ways;

source: སྐྱི་གཡའ་ཞིང་མི་དགའ་བ་ཆེན་པོ་བསྐྱེད་པ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རིས་གཞོམ་པའི་སྒྲ་ལྟ་བུའང་ཐོས་སོ།
en: the sounds of their horror and distress were like those of the beings in the great Saṃghāta hell.

source: །དེས་དེ་ལྟར་ཁ་བཏགས་ཏེ་བརྡུངས་པ་དང་། ཤིན་ཏུ་འཇིགས་པའི་དྲག་ཤུལ་མཐོང་ནས། འདི་སྙམ་དུ་གྱུར་ཏེ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་ཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་ཞིང་འབད་དེ།
en: When Sudhana saw this dreadful and terrifying violence, he thought, “I am set on the highest, complete enlightenment and am dedicated to seeking the bodhisattva conduct in order to benefit and bring happiness to all beings.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་དགེ་བ་ནི་ཅི་ཞིག་བགྱི།
en: The kalyāṇamitras always ask, ‘What good actions has a bodhisattva done?

source: མི་དགེ་བ་ནི་གང་ཞིག་སྤང་ཞེས་འདྲི་འདྲི་ན། རྒྱལ་པོ་མེ་འདི་ལ་ནི་དགེ་བའི་ཆོས་ཀྱང་མྱེད་དེ།
en: What bad actions have been avoided?’ But this King Anala is devoid of the qualities of good actions.

source: ཁ་ན་མ་ཐོ་བ་ཆེན་པོའི་ལས་ལ་སྤྱོད་པ་ཡིད་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཤིན་ཏུ་གཏུམ་པ་དང་ལྡན་པ།
en: He is engaged in great transgressive acts. He has wicked thoughts in his mind.

source: སེམས་ཅན་ཕ་རོལ་གྱི་སྲོག་གཅད་པ་ལ་ཞུགས་པ།
en: He is engaged in taking the lives of others.

source: སེམས་ཅན་ཕ་རོལ་ཤིན་ཏུ་མནར་བ་ལ་བརྩོན་པ།
en: He is dedicated to harming other beings.

source: ཚེ་ཕྱི་མ་ལ་ལྟ་བ་མྱེད་པ།
en: He has no concern for his next life.

source: ངན་སོང་གི་གཡང་སའི་གད་ཀ་ན་འདུག་པ་ཞིག་ན།
en: He is at the edge of the precipice of the lower realms.

source: འདི་ལས་ཅིག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའང་ཐོས་པར་འགྱུར་རམ་སྙམ་སྟེ།
en: What bodhisattva conduct could I hear from him?”

source: དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་དེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་མངོན་པར་བརྩོན་པ། སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་པའི་སེམས་དང་ལྡན་པ་དེ་ལ་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས་ལྷ་མང་པོས་བོས་པ།
en: While Sudhana, who was motivated to protect the entire realm of beings, whose mind had developed great compassion, was thinking and contemplating in that way, devas who were up in the sky above him addressed him in this way:

source: རིགས་ཀྱི་བུ་དྲང་སྲོང་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ཏུ་བྱ་བ་མི་དྲན་ནམ།
en: “Noble one, do you not remember the instructions of the kalyāṇamitra ṛṣi Jayoṣmāyatana?”

source: དེས་གྱེན་དུ་ནམ་མཁའི་དབྱིངས་ལ་བལྟས་ནས། དྲན་ནོ་ཞེས་བརྗོད་དོ། །ལྷ་རྣམས་ཀྱིས་སྨྲས་པ།
en: Sudhana looked up into the realm of the sky and answered, “Yes, I remember.”

source: རིགས་ཀྱི་བུ་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་དེ་ལྟར་ཐེ་ཚོམ་མ་བསྐྱེད་ཅིག །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་ཡང་དག་པ་མ་ནོར་བར་སྟོན་གྱི་ལོག་པ་མ་ཡིན་ནོ།
en: The devas said, “Noble one, do not doubt in this way the instruction of the kalyāṇamitra! Noble one, the kalyāṇamitras give correct guidance and never do so incorrectly.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པས་སྤྱོད་པའི་ཡེ་ཤེས་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Noble one, the wisdom of the bodhisattvas in practicing skillful methods is inconceivable.

source: །སེམས་ཅན་ཡོངས་སུ་སྡུད་པའི་ཡེ་ཤེས་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in gathering beings as pupils is inconceivable.

source: །སེམས་ཅན་ལ་ཕན་འདོགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in benefiting beings is inconceivable.

source: །སེམས་ཅན་ཚར་གཅོད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in subjugating beings is inconceivable.

source: །སེམས་ཅན་གཟེངས་བསྟོད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in inspiring beings is inconceivable.

source: །སེམས་ཅན་ཡོངས་སུ་སྦྱོང་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in purifying beings is inconceivable.

source: །སེམས་ཅན་ཡོངས་སུ་སྐྱོང་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in protecting beings is inconceivable.

source: །སེམས་ཅན་འཛུདཔའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in leading beings to understanding is inconceivable.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in ripening beings is inconceivable.

source: སེམས་ཅན་འདུལ་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in guiding beings is inconceivable.

source: །སོང་རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དྲིས་ཤིག་ཅེས་ནས།
en: “Noble one, go and ask him about bodhisattva conduct!”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷའི་ངག་མཉན་ཏེ། རྒྱལ་པོ་མེ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Sudhana, the head merchant’s son, listened to what the devas had said and approached the king.

source: རྒྱལ་པོ་མེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། རྒྱལ་པོ་མེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: When he had reached him, Sudhana bowed his head to the feet of King Anala, circumambulated him, keeping him to his right, many hundreds of thousands of times, and then sat before him and with palms together and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་རྒྱལ་པོ་མྱེས་རྒྱལ་པོའི་བྱ་བ་བྱས་ཏེ། སེང་གེའི་ཁྲི་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ལག་པ་གཡས་པ་ནས་བཟུང་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་ཏ་ལའི་རྒྱལ་མཚན་དུ་ཁྲིད་དོ། །དེ་མཐར་གྱིས་རང་གི་གནས་སུ་ཕྱིན་ནས།
en: King Anala, having concluded his duties as a king, rose from his lion throne, and with his right hand he took hold of Sudhana, the head merchant’s son, and led him into the Tāladhvaja Palace.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་ཁྲིད་དེ་ཁྲི་ལ་བཞག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ངའི་ཁྱིམ་དང་ལོངས་སྤྱོད་ལ་ལྟོས་ཤེས་ནས།
en: When they had entered his residence, the king led Sudhana, the head merchant’s son, into the harem, where he sat upon a throne and said to Sudhana, “Noble one, look around at my home and possessions!”

source: དེས་བལྟས་ན་ཁྱིམ་དེ་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་རིན་པོ་ཆེ་བདུན་གྱི་ར་བས་ཡོངས་སུ་བསྐོར་བ།
en: Sudhana looked around and saw that the building was huge and vast, encircled by walls made of the seven precious materials.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་བརྒྱ་སྟོང་དུ་མས་རབ་ཏུ་བརྒྱན་པ།
en: It was beautified by a variety of palaces of precious jewels, adorned with many hundreds of thousands of precious kūṭāgāras.

source: ནོར་བུ་རིན་པོ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་ཤིན་ཏུ་འབར་བས་གཟི་བརྗིད་རབ་ཏུ་འབར་བར་བྱས་པ།
en: It was brilliantly bright with the shining light of countless precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པ་ཐ་དད་པ་རྣམ་པར་ཕྱེ་ཞིང་བྲིས་པས་རྣམ་པར་མཛེས་པར་བྱས་པ། མུ་ཏིག་དམར་པོའི་ཀ་བ་བཀྱེ་བ།
en: There were pillars made of red pearls that were beautified by arrangements of a shining variety of different precious jewels.

source: ནང་དུ་སེང་གེའི་ཁྲི་མུ་སར་གལ་བ་ལས་བྱས་པ། རིན་པོ་ཆེ་བརྒྱ་སྟོང་དུ་མས་རྣམ་པ་སྣ་ཚོགས་སུ་བརྒྱན་པ། ཤིན་ཏུ་བཤམས་པ།
en: Inside was a beautifully constructed lion throne made of white coral that was adorned with many hundreds of thousands of jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་སྒྲ་སྣང་བའི་སེང་གེའི་རྒྱལ་མཚན་ཤིན་ཏུ་བསྒྲེང་བ།
en: There were raised lion banners made of precious asteria jewels.

source: སྟེང་ནས་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་བླ་རེ་བྲེས་པ།
en: Above the throne was a canopy of shining, precious jewels.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཡོག་པ།
en: The room was covered with nets of strings of various wish-fulfilling precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་གྲངས་མྱེད་པས་རབ་ཏུ་བརྒྱན་པའི་བ་གམ་གྱི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by an array of ornamental spires adorned by a countless variety of precious jewels.

source: ཨ་སྨ་གར་བྷ་ལས་བྱས་པའི་རྫིང་ཆུ་བསིལ་བས་གང་བ་དང་ལྡན་པ།
en: There were pools made from emeralds that were filled with cool water.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གིས་འཁོར་བར་འདུག་པ་མཐོང་ངོ་།
en: It was encircled by trees made of various precious materials.

source: །དེའི་འཁོར་བུད་མྱེད་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ།
en: Sudhana saw that the ten million women of the king’s entourage were beautiful, attractive, and pretty;

source: ཁ་དོག་རྒྱས་པ། བཟང་བའི་ཕུལ་དུ་བྱ་བ་དང་ལྡན་པ།
en: had the most perfect, magnificent color;

source: སྒྱུ་རྩལ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་མཁས་པ་སྔོན་དུ་ལྡང་བ།
en: had mastered all skills;

source: ཕྱི་ནས་ཉལ་བ་བྱམས་པའི་སེམས་དང་ལྡན་པ།
en: rose before him and slept after him; had loving minds;

source: ཅི་བསྒོ་བ་བཞིན་དུ་བྱེད་ཅིང་།
en: did whatever they were told to do;

source: ངག་ཉན་པ་བྱེ་བ་ཕྲག་བཅུ་ཡང་འཁོད་པར་མཐོང་ངོ་།
en: and were obedient.

source: །དེ་ནས་རྒྱལ་པོ་མྱེས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཇི་སྙམ་དུ་སེམས།
en: Then King Anala asked Sudhana, the head merchant’s son, “Noble one, what do you think?

source: ཅིག་སྡིག་པ་བྱེད་པ་རྣམས་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མངོན་པར་གྲུབ་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of ripening of karma for those who have committed bad actions?

source: ལུས་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ། འཁོར་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect body?

source: སྐྱིད་པ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect great happiness?

source: དབང་ཕྱུག་དང་དབང་ཆེན་པོ་ཐོབ་པ་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect attainment of sovereignty and great power?”

source: སྨྲས་པ་འཕགས་པ་དེ་ལྟ་བུ་ནི་མ་མཆིས་སོ། །དེས་སྨྲས་པ།
en: Sudhana replied, “Ārya, there are no such things.”

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། སྒྱུ་མའི་རྣམ་པ་ཐོབ་པ་སྟེ།
en: King Anala said, “Noble one, I have attained the bodhisattva liberation called the attainment of illusions
